const MORSE_TABLE = {
  ".-": "a",
  "-...": "b",
  "-.-.": "c",
  "-..": "d",
  ".": "e",
  "..-.": "f",
  "--.": "g",
  "....": "h",
  "..": "i",
  ".---": "j",
  "-.-": "k",
  ".-..": "l",
  "--": "m",
  "-.": "n",
  "---": "o",
  ".--.": "p",
  "--.-": "q",
  ".-.": "r",
  "...": "s",
  "-": "t",
  "..-": "u",
  "...-": "v",
  ".--": "w",
  "-..-": "x",
  "-.--": "y",
  "--..": "z",
  ".----": "1",
  "..---": "2",
  "...--": "3",
  "....-": "4",
  ".....": "5",
  "-....": "6",
  "--...": "7",
  "---..": "8",
  "----.": "9",
  "-----": "0",
};

function decode(expr) {
  let result = ""; // Переменная для хранения результата

  // Разделяем строку на подстроки длиной по 10 символов
  for (let i = 0; i < expr.length; i += 10) {
    let letterCode = expr.slice(i, i + 10); // Получаем код символа из 10 символов

    if (letterCode === "**********") {
      // Если это пробел
      result += " ";
    } else {
      // Заменяем 10 -> . и 11 -> -
      let morseCode = "";
      for (let j = 0; j < letterCode.length; j += 2) {
        let pair = letterCode.slice(j, j + 2);
        if (pair === "10") {
          morseCode += ".";
        } else if (pair === "11") {
          morseCode += "-";
        }
      }

      result += MORSE_TABLE[morseCode]; // Преобразуем код Морзе в символ и добавляем к результату
    }
  }

  return result;
}

module.exports = {
  decode,
};
